{
  "Comment.nvim": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "catppuccin": { "branch": "main" },
  "cloak.nvim": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-calc": { "branch": "main" },
  "cmp-emoji": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-nvim-lua": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-treesitter": { "branch": "master" },
  "cmp-vimtex": { "branch": "master" },
  "cmp_luasnip": { "branch": "master" },
  "dial.nvim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "dracula.nvim": { "branch": "main" },
  "eldritch.nvim": { "branch": "master" },
  "eyeliner.nvim": { "branch": "main" },
  "fidget.nvim": { "branch": "main" },
  "flash.nvim": { "branch": "main" },
  "friendly-snippets": { "branch": "main" },
  "git-worktree.nvim": { "branch": "master" },
  "gitlinker.nvim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "gopher.nvim": { "branch": "main" },
  "grug-far.nvim": { "branch": "main" },
  "gx.nvim": { "branch": "main" },
  "harpoon": { "branch": "harpoon2" },
  "hawtkeys.nvim": { "branch": "main" },
  "inc-rename.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "kanagawa": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lazygit.nvim": { "branch": "main" },
  "lsp-inlayhints.nvim": { "branch": "main" },
  "lsp-zero.nvim": { "branch": "v3.x" },
  "lsp_signature.nvim": { "branch": "master" },
  "lspkind.nvim": { "branch": "master" },
  "lualine.nvim": { "branch": "master" },
  "markdown-preview.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason-null-ls.nvim": { "branch": "main" },
  "mason-nvim-dap.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "middleclass": { "branch": "master" },
  "mini.icons": { "branch": "main" },
  "moonfly": { "branch": "master" },
  "neodev.nvim": { "branch": "main" },
  "neogen": { "branch": "main" },
  "neogit": { "branch": "master" },
  "nlsp-settings.nvim": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "none-ls.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "numb.nvim": { "branch": "master" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-colorizer.lua": { "branch": "master" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-go": { "branch": "main" },
  "nvim-dap-ui": { "branch": "master" },
  "nvim-dap-virtual-text": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-nio": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-spectre": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-ts-context-commentstring": { "branch": "main" },
  "nvim-ufo": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "obsidian.nvim": { "branch": "main" },
  "octo.nvim": { "branch": "master" },
  "oil.nvim": { "branch": "master" },
  "persistence.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "promise-async": { "branch": "main" },
  "rose-pine": { "branch": "main" },
  "smartcolumn.nvim": { "branch": "main" },
  "ssr.nvim": { "branch": "main" },
  "substitute.nvim": { "branch": "main" },
  "telescope-file-browser.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-ui-select.nvim": { "branch": "master" },
  "telescope-undo.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "todo-comments.nvim": { "branch": "main" },
  "treesj": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "vim-abolish": { "branch": "master" },
  "vim-cool": { "branch": "master" },
  "vim-dadbod": { "branch": "master" },
  "vim-dadbod-completion": { "branch": "master" },
  "vim-dadbod-ui": { "branch": "master" },
  "vim-eunuch": { "branch": "master" },
  "vim-helm": { "branch": "master" },
  "vim-kitty": { "branch": "main" },
  "vim-matchup": { "branch": "master" },
  "vim-rsi": { "branch": "master" },
  "vim-startuptime": { "branch": "master" },
  "vim-tmux-navigator": { "branch": "master" },
  "vimtex": { "branch": "master" },
  "which-key.nvim": { "branch": "main" },
  "windows.nvim": { "branch": "main" },
  "wrapping.nvim": { "branch": "master" },
  "yanky.nvim": { "branch": "main" }
}
