cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "elastic/tap"
tap "minio/stable"
tap "railwaycat/emacsmacport"

# Search tool like grep, but optimized for programmers
brew "ack"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Colorize logfiles and command output
brew "grc"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Platform built on V8 to build network applications
brew "node"
# Highly capable, feature-rich programming language
brew "perl"
# Object-relational database system
brew "postgresql"
# Object-relational database system
brew "postgresql@12"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Move files to macOS's Trash
brew "rmtrash"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Diff images from the command-line
brew "spaceman-diff"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# User interface to the TELNET protocol
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Vi 'workalike' with many additional features
brew "vim"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Simplified and community-driven man pages
brew "tldr"
# NCurses Disk Usage
brew "ncdu"
# Distributed search & analytics engine
brew "elastic/tap/elasticsearch-full"
# TaskWarrior setup
brew "task"
brew "taskd"
brew "tasksh"
# Emacs
brew "emacs-mac", args: ["with-modules"]

cask "google-chrome"
cask "brave-browser"
cask "handbrake"
cask "iterm2"
cask "alfred"
cask "notion"
cask "slack"
cask "spotify"
cask "1password"
cask "mactex"
cask "skim"
cask "dropbox"
cask "synergy"
cask "grammarly"
cask "transmission" 
cask "visual-studio-code"
cask "karabiner-elements"
